[
    {
        "title": "Optimization and Development Intern",
        "organization": "Mercedes-Benz USA",
        "liveUrl": "https://www.mbusa.com/en/home",
        "duration": "Aug 2023 - Mar 2024",
        "description": [
            "Achieved a 15% enhancement in product quality through the application of clustering algorithms (machine learning) on Azure. Developed an intelligent robotic process automation system leveraging computer vision, natural language processing, and generative AI",
            "Consistently improved quality management efficiency by 25% while simultaneously reducing warranty costs by 15%. This accomplishment was realized through continuous development and enhancement of databases and automation bots, employing technologies such as VBA, Java, C++, Linux, and DevOps tools.",
            "Successfully maintained a 20% reduction in response time to quality issues by implementing and managing reporting tools using Python, Java,Qlik Sense, and Power Automate for global KPI monitoring, resulting in continuous advancements in overall quality control."
        ],
        "logo": "Mercedes-Benz USA"
    },
    {
        "title": "Data Analytics Intern",
        "organization": "DHMC",
        "liveUrl": "https://www.dartmouth-hitchcock.org/",
        "duration": "Jun 2023 - Aug 2023",
        "description": [
            "Developed data visualization pipelines for large-scale datasets, resulting in a 40% reduction in data analysis time. Utilized Kafka, Spark,Hadoop, and Hive alongside shell scripting, Docker, Kubernetes, and Singularity. Applied machine learning techniques on GPU (CUDA) to identify patterns and correlations, leading to the discovery of 20 novel genetic markers associated with a specific disease.",
            "Created a versatile software application using Groovy, Java, R, and Python for genomic data visualization. The application is projected to increase data analysis efficiency by 50% upon deployment."
        ],
        "logo": "DHMC"
    },
    {
        "title": "Software Engineer(Machine Learning)",
        "organization": "Iolite Softwares",
        "liveUrl": "https://iolitesoftwares.com/",
        "duration": "Jan 2022 - Jul 2022",
        "description": [
            "Developed and implemented a large-scale commercial CRM system using HTML, CSS, Javascript, GraphQL,React, Angular,Python, and ASP.net core, resulting in the generation of 20,000+ leads and management of 10,000+ clients",
            "Utilized data analysis and Machine Learning to tailor campaigns and make decisions for customers based on RFM and Customer Lifetime Value metrics, resulting in increased customer satisfaction and dependency on the company or product."
        ],
        "logo": "IoliteSoftwares"
    },
    {
        "title": "Data Scientist Intern",
        "organization": "Bhaskaracharya Institute for Space Applications and Geoinformatics(BISAG)",
        "liveUrl": "https://bisag-n.gov.in/",
        "duration": "Jun 2021 - Jul 2021",
        "description": [
            "Developed, Implemented and Designed a Web Application for Sentiment Analysis of over 1 Million Covid vaccination tweets, providing insights through Exploratory Data Analytics to mobilize rural and suburban population for covid vaccination.",
            "Utilized Project management skills to plan, schedule and deliver the project successfully with the use of various tools including streamlit, heroku, azure, git and docker while also ensuring scalability, readability and repeatability of the developed workflows with debugging and QA testing."
        ],
        "logo": "BISAG"
    },
    {
        "title": "Artificial Intelligence Intern",
        "organization": "IIT Gandhinagar",
        "liveUrl": "https://srip.iitgn.ac.in/info/",
        "duration": "May 2021 - Jul 2021",
        "description": [
            "Developed an inverse design for high-power RF LDMOS Transistors using deep learning, resulting in extrication of over 1000 hours of computational procedures",
            "Implemented a Deep Neural Network (DNN) based framework with Bayesian Optimizer to supersede traditional simulators(T-CAD) which were time-consuming",
            "Analyzed and used more than 10 structural parameters for breakdown voltage prediction and corresponding process of inverse design",
            "Built and experimented with neural networks to reduce prediction average error and provide significant speed up to the breakdown voltage prediction process",
            "Utilized machine learning and deep learning techniques to improve the performance of the DNN framework"
        ],
        "logo": "IITGandhinagar"
    },
    {
        "title": "Software Development Engineer Intern",
        "organization": "IIIT NAYA RAIPUR ",
        "liveUrl": "https://ims.iiitnr.edu.in/Outreach/",
        "duration": "May 2021 - Jul 2021",
        "description": [
            "Developed and implemented an effective bandwidth distribution strategy using Deep Reinforcement Learning, resulting in a reduction of outages by 80% in 5G Heterogeneous Wireless Networks",
            "Utilized project management and analytical skills to design and deliver a solution for load balancing and interference coordination in Heterogeneous cellular networks",
            "Experimented with various methods to achieve maximum long-term overall network utility while ensuring quality of service requirements for user equipment and implemented double deep Q-network (DDQN) strategy",
            "Demonstrated the effectiveness of the proposed method through simulation and showed performance gains under different user distribution scenarios."
        ],
        "logo": "IIITNR"
    },
	{
        "title": "Data Science Researcher and Web Developer",
        "organization": "ICMR – Centre for Innovation and Bio‑Design(CiBiod) ",
        "liveUrl": "https://www.icmr.gov.in/",
        "duration": "Jun 2020 - Sep 2020",
        "description": [
            "Developed high-accuracy malady prediction app for 1,000+ patients with machine learning. Integrated Kafka and Spark for scalable processing,improving model training on extensive medical datasets",
            "Analyzed and experimented with various symptoms and factors to improve the scalability, readability, and repeatability of the developed workflow, utilizing Python, Flask, SQL and debugging skills to deliver a high-performing product."
        ],
        "logo": "CIBIOD"
    },
	{
        "title": "Data Science AND Business Analytics INTERN",
        "organization": "The Sparks Foundation",
        "liveUrl": "https://internship.thesparksfoundation.info/#grip",
        "duration": "Sep 2020 - Oct 2020",
        "description": [
            "Completion of numerous tasks related to data analysis, data cleaning, data interpretation, and representation besides applying suitable machine learning algorithms to supplant industrial demands"
        ],
        "logo": "SPARK"
    },
    {
        "title": "Software Development Engineer",
        "organization": "Shreeji Inc",
        "liveUrl": "https://www.shreejiinc.co.in/",
        "duration": "2018 - 2021",
		"description": [
            "Successful Completion of IT Projects related to Employee Monitoring System, Employee Performance Evaluation System, and Customer Service Enhancement System alongside maintaining IT infrastructure."
        ],
        "logo": "SHREEJI"
    }
]
